-- Чсдоо

-- ЧсЧгЪксЧу скбж Уцс 10 енцн нэ ЬЯцс Чсдоо
SELECT TOP 10 *
FROM ['Apartments (Чсдоо)$'];

-- ЧсЧгЪксЧу сЭгЧШ уЪцги кЯЯ Чслбн нэ Чсдоо
SELECT AVG([кЯЯ_ Чслбн]) AS уЪцги_кЯЯ_Чслбн
FROM ['Apartments (Чсдоо)$'];

-- ЧсЧгЪксЧу скбж Ъцвэк кЯЯ Чсдоо ЭгШ кЯЯ Чслбн
SELECT [кЯЯ_ Чслбн], COUNT(*) AS кЯЯ_Чсдоо
FROM ['Apartments (Чсдоо)$']
GROUP BY [кЯЯ_ Чслбн]
ORDER BY кЯЯ_Чсдоо DESC;

-- ЧсЧгЪксЧу сукбнЩ ЧсУЭэЧС ЧсУпЫб дэцк№Ч ШЧсдоо
SELECT ЧсЭэ, COUNT(*) AS кЯЯ_Чсдоо
FROM ['Apartments (Чсдоо)$']
GROUP BY ЧсЭэ
ORDER BY кЯЯ_Чсдоо DESC;

-- ЧсЧгЪксЧу сЪЭсэс Чсдоо ЭгШ ЧсуЯэфЩ цЧсЭэ
SELECT ЧсуЯэфЩ, ЧсЭэ, COUNT(*) AS кЯЯ_Чсдоо
FROM ['Apartments (Чсдоо)$']
GROUP BY ЧсуЯэфЩ, ЧсЭэ;

-- ЧсЧгЪксЧу ссШЭЫ кф Уксь гкб ссдоЩ нэ пс Ээ
SELECT ЧсЭэ, MAX([Чсгкб _ЧсЧЬуЧсэ]) AS Уксь_гкб_доЩ
FROM ['Apartments (Чсдоо)$']
GROUP BY ЧсЭэ
ORDER BY Уксь_гкб_доЩ DESC;

-- ЧсЧгЪксЧу ссШЭЫ кф УЯфь гкб ссдоЩ нэ пс Ээ
SELECT ЧсЭэ, MIN([Чсгкб _ЧсЧЬуЧсэ]) AS УЯфь_гкб_доЩ
FROM ['Apartments (Чсдоо)$']
GROUP BY ЧсЭэ
ORDER BY УЯфь_гкб_доЩ DESC;

-- ЧсЧгЪксЧу сЭгЧШ уЪцги Чсгкб ЧсХЬуЧсэ сскоЧбЧЪ ШфЧС№ ксь Чскуб
SELECT [куб _ЧскоЧб], AVG([Чсгкб _ЧсЧЬуЧсэ]) AS уЪцги_Чсгкб
FROM ['Apartments (Чсдоо)$']
GROUP BY [куб _ЧскоЧб];

-- ЧсЧгЪксЧу сукбнЩ ЧсугЧЭЧЪ ЧсдЧЦкЩ ссдоо
SELECT ЧсугЧЭЩ, COUNT(*) AS кЯЯ_Чсдоо
FROM ['Apartments (Чсдоо)$']
GROUP BY ЧсугЧЭЩ;

-- ЧсЧгЪксЧу скЯЯ Чсдоо нэ пс Ээ цЭгШ кЯЯ Чслбн
SELECT ЧсЭэ, [кЯЯ_ Чслбн], COUNT(*) AS кЯЯ_Чсдоо
FROM ['Apartments (Чсдоо)$']
GROUP BY ЧсЭэ, [кЯЯ_ Чслбн];

-- Чснсс

-- ЧсЧгЪксЧу сЭгЧШ уЪцги кЯЯ Чслбн цЧсеЧсЧЪ цЧсЭуЧуЧЪ нэ Чснсс
SELECT AVG([кЯЯ Чслбн]) AS уЪцги_кЯЯ_Чслбн, AVG([кЯЯ ЧсеЧсЧЪ]) AS уЪцги_кЯЯ_ЧсеЧсЧЪ, AVG([кЯЯ ЧсЭуЧуЧЪ]) AS уЪцги_кЯЯ_ЧсЭуЧуЧЪ
FROM ['Villas (Чснсс)$'];

-- ЧсЧгЪксЧу скбж Чснсс ЭгШ ЧсЭэ цкЯЯхЧ
SELECT  ЧсЭэ, COUNT(*) AS кЯЯ_Чснсс
FROM ['Villas (Чснсс)$']
GROUP BY  ЧсЭэ;

-- ЧсЧгЪксЧу сукбнЩ кЯЯ Чснсс ЧсЪэ ЪЭЪцэ ксь убЧно уЫс угШЭ Уц Эцд
SELECT 
    SUM(IIF(угШЭ = 'фку' OR Эцд = 'фку', 1, 0)) AS кЯЯ_Чснсс_аЧЪ_ЧсубЧно_ЧсХжЧнэЩ,
    COUNT(*) AS кЯЯ_Чснсс_ЧспсэЩ
FROM ['Villas (Чснсс)$'];

-- ЧсЧгЪксЧу скбж Уксь гкб нэ пс Ээ сснсс
SELECT ЧсЭэ, MAX([Чсгкб ЧсЧЬуЧсэ]) AS Уксь_гкб_нэсЧ
FROM ['Villas (Чснсс)$']
GROUP BY ЧсЭэ;

-- ЧсЧгЪксЧу скбж Чснсс ЧсЪэ ЪЭЪцэ ксь Эцд цуЯЮс ссгэЧбЩ цуекЯ
SELECT *
FROM ['Villas (Чснсс)$']
WHERE Эцд = 'фку' AND уекЯ = 'фку' AND [уЯЮс гэЧбЩ] = 'фку'





-- ХфдЧС ЬЯцс "коЧб ЧсбэЧж" суоЧбфЩ ЧсУгкЧб ЭгШ ЧсУЭэЧС
CREATE TABLE коЧб_ЧсбэЧж (
    ЧсЭэ NVARCHAR(50),
    гкб_ЧсУбж DECIMAL(18, 2),
    гкб_ЧсдоЩ DECIMAL(18, 2),
    гкб_ЧснэсЧ DECIMAL(18, 2)
);

-- ХЯЮЧс ЧсШэЧфЧЪ Хсь ЬЯцс "коЧб ЧсбэЧж" уф ЬЯЧцс ЧсУбЧжэ цЧсдоо цЧснсс
INSERT INTO коЧб_ЧсбэЧж (ЧсЭэ, гкб_ЧсУбж)
SELECT ЧсЭэ, MAX([Чсгкб _ЧсХЬуЧсэ]) AS гкб_ЧсУбж
FROM ['Land (ЧсЧбЧжэ)$']
GROUP BY ЧсЭэ;

INSERT INTO коЧб_ЧсбэЧж (ЧсЭэ, гкб_ЧсдоЩ)
SELECT ЧсЭэ, MAX([Чсгкб _ЧсЧЬуЧсэ]) AS гкб_ЧсдоЩ
FROM ['Apartments (Чсдоо)$']
GROUP BY ЧсЭэ;

INSERT INTO коЧб_ЧсбэЧж (ЧсЭэ, гкб_ЧснэсЧ)
SELECT ЧсЭэ, MAX([Чсгкб ЧсЧЬуЧсэ]) AS гкб_ЧснэсЧ
FROM ['Villas (Чснсс)$']
GROUP BY ЧсЭэ;



select *
from коЧб_ЧсбэЧж




